# XVector Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CylindricalHelix..::..XVector Property
CylindricalHelix Class See Also
---
The X direction vector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ XVector { get; }
```

Visual Basic
---
```text
Public ReadOnly Property XVector As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ XVector {
	XYZ^ get ();
}
```

# See Also
CylindricalHelix Class
Autodesk.Revit.DB Namespace